//
//  ShowErrorCode.m
//  ShowLive
//
//  Created by 周华 on 2018/3/21.
//  Copyright © 2018年 vning. All rights reserved.
//

#import "ShowErrorCode.h"

@implementation ShowErrorCode
+(BOOL)serviceCode:(NSInteger)code{
    return [[self codeList] containsObject:@(code).stringValue];
}

+(NSArray *)codeList{
    return @[@"0",              //  "系统异常，请重试"
             @"1000",           //  "参数不足"
             @"1001",           //  "尚未支持"
             @"1002",           //  "参数错误"
             // 用户相关
             @"2001",           //  "该昵称已被他人使用"
             @"2002",           //  "该手机还没有注册过"
             @"2003",           //  "密码错误"
             @"2004",           //  "该邮箱还没有注册过"
             @"2005",           //  "未找到该用户"
             @"2006",           //  "已绑定其他帐号"
             @"2007",           //  "昵称包含不支持的字符"
             @"2008",           //  "昵称长度不能超过8个汉字"
             @"2009",           //  "邮箱格式不正确"
             @"2010",           //  "与绑定的第三方帐号不一致"
             @"2011",           //  "密码长度应为6-18位"
             @"2012",           //  "第三方验证错误"
             @"2013",           //  "手机号格式错误"
             @"2014",           //  "验证码错误或者已经失效"
             @"2015",           //  "xxxxx"
             @"2016",           //  "网络繁忙，请重新登录。"
             @"2017",           //  "本设备已经注册成功，请返回并直接登录。请勿在短时间内，同一设备反复注册，多谢您的支持。"
             @"2018",           //  "无法发送验证码，因为发送次数已经达到限制。"
             @"2019",           //  "登录已过期，请重新登录"
             @"2020",           //  "请勿在短时间内反复注册，多谢您的支持。"
             @"2021",           //  "暂不支持直接注册，请使用第三方账号注册登录"
             @"2022",           //  "绑定两个以上第三方账号才能使用此功能"
             @"2023",           //  "您已注册过邮箱"
             @"2024",           //  "尚未支持该第三方账号登录"
             @"2025",           //  "该手机号已经注册过"
             @"2026",           //  "昵称太火，请换一个昵称再试"
             @"2027",           //  "手机未绑定"
             @"2028",           //  "最多设置10个房间管理员"
             @"2029",           //  "他已经是您的房间管理员了"
             @"2030",           //  "不能把自己设为您的房间管理员了"
             @"2031",           //  "签名长度不能超过30个汉字"
             @"2032",           //  "存在敏感词，请修改后提交～"
             @"2033",           //  "请输入6-16位密码"
             @"2034",           //  "标签长度不能超过8个汉字"
             // 关系相关
             @"2100",           //  不能关注自己
             @"2101",           //  你已经关注过人家了
             @"2102",           //  你还没有关注人家呢
             @"2103",           //  关注超出限制数量
             // 图片相关
             @"3001",           //  图片不能为空
             @"3002",           //  图片文件尺寸过大
             @"3003",           //  不支持的文件格式
             @"3004",           //  "文件上传失败"
             @"3005",           //  "标题不能超过20个字"
             // 意见反馈
             @"4001",           //  "联系方式过长"
             @"4002",           //  "反馈意见太长了，精简点吧"
             @"4003",           //  "评论内容不能超过200个字"
             // 权限相关
             @"5001",           //  "对⽅已将您拉黑，禁止此操作"
             @"5002",           //  "抱歉，你被禁止此操作"    封禁
             @"5003",           //  "抱歉，你无权进行操作"
             @"5004",           //  "你发的太快啦，冲杯咖啡吧，稍后再来~"
             @"5005",           //  "验证过期，请重新登录"    token失效
             @"5006",           //  "会员能看到更多视频哦~"
             @"5007",           //  "您已经被禁止登录，如有疑问请联系客服"
             @"5008",           //  "自己不能把自己踢出房间"
             @"5009",           //  "自己不能把自己禁言"
             // 私信相关
             @"6001",           //  "你打招呼太频繁了，休息一下再发吧"
             @"6002",           //  "你们已经是好友了，去对话页面聊天吧"
             // 作品相关
             @"7001",           //  "该作品不存在"
             @"7002",           //  "该作品未通过审核"
             @"7003",           //  "您没有权限查看该作品"
             @"7004",           //  "今天发布解密的作品已达上限，请开通Vip增加上限."
             @"7005",           //  "该作品已经删除"
             // 付费相关
             @"8001",           //  "余额不足"
             @"8002",           //  "充值失败"
             @"8003",           //  "https needed"
             @"8004",           //  "invalid"
             @"8005",           //  "交易失败"
             @"8006",           //  "礼物不存在"
             @"8007",           //  "不存在这个人"
             @"8008",           //  "自己不能送给自己礼物"
             // 地理位置相关
             @"9001",           //  "没有获得位置信息，试试打开gps吧~"
             @"9002",           //  "不支持的城市"
             // 搜索相关
             @"10001",           // "请输入正确的昵称或ID"
             // 安全相关
             @"11001",           // "请求头参数错误"
             @"11002",           // "签名错误"
             @"11003",           // "已满每日最多验证次数"
             @"11004",           // "获取过于频繁"
             @"11005",           // "您的手机时间不对，请调整后重试"
             @"11006",           // "#msg#"
             // 签约红人相关
             @"12001",           // "您尚未签约"
             @"12002",           // "您已解约"
             @"12003",           // "您的星币不足"
             @"13001",           // "设置金额太少"
             @"13002",           // "已经回复过了"
             @"14001",           // "审核中，请耐心等待"
             @"15001"            //  "必须使用带有人物头像的图片"
             ];
}

@end
